Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: །གང་ཇི་ལྟ་ཇི་ལྟ་བུར་སངས་རྒྱས་ཀྱི་ཆོས་ཉན་པ་དེ་ལྟ་དེ་ལྟ་བུར་བདུད་སྡིག་ཅན་གྱིས་གླགས་མི་རྙེད་པར་འགྱུར་རོ།
en: The more they hear about the qualities of buddhas, the more invulnerable they will be to evil Māra.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: འདི་ལྟར་དེ་དག་སངས་རྒྱས་ཀྱིས་དགོངས་པར་འགྱུར་ཏེ། དེའི་ཚེ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་སྤངས་པར་འགྱུར་རོ།
en: It is because the buddhas will care for them, and while being so cared for, they will not forsake unexcelled, perfect and complete awakening.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྤོས་ཀྱི་བསོད་ནམས་ཀྱི་ཚོགས་གང་ཅི་ཡོད་པ་ཐམས་ཅད་ངས་ཁྱོད་ལ་བཤད་ན་སེམས་ཅན་རྣམས་མྱོས་པར་འགྱུར་ཏེ།
en: The Blessed One continued, “Śāriputra, if I told you about the entire collection of merit belonging to the thus-gone one Always Fragrant, beings would go mad.

source: དེ་དག་མཚན་ཐོས་པའི་དགེ་བའི་རྩ་བ་ལ་མོས་པའམ་དད་པར་འགྱུར་བའི་བསོད་ནམས་དང་ལྡན་པ་མེད་དོ།
en: For they do not have the merit to be devout towards or have faith in the roots of virtue acquired from hearing his name.

source: །ཤཱ་རིའི་བུ་ཡང་གང་དག་མོས་པ་དང་། དད་པ་དང་། དེ་བཞིན་དུ་སེམས་ཡང་དག་པར་དགའ་བར་བྱེད་ཅིང་བདག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཕྱིར་མ་ལོག་པའོ་སྙམ་དུ་སེམས་ན། ཤཱ་རིའི་བུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེའི་ཕྱོགས་ཙམ་ཞིག་བསྟན་པར་བྱའོ།
en: For those who think, with devotion, faith, and true joy, that they will not turn away from the qualities of buddhas, Śāriputra, I will explain a mere portion of that heap of merit.

source: །མཁས་པ་དག་ཡེ་ཤེས་ཆེན་པོ་དང་ལྡན་པར་གྱུར་པ་དགོངས་ཏེ་གསུངས་པ་ལ་འཇུག་པར་འགྱུར་རོ།
en: They will partake of the teaching intended for sages endowed with great wisdom.

source: །ཡང་ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཙམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་བཅུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་གང་བར་བྱས་ཏེ། ཚད་མེད་པའི་སངས་རྒྱས་ལ་བསྐལ་པ་ཚད་མེད་པར་ཉིན་རེ་ཞིང་སྦྱིན་པ་བྱིན་པ་བས་སྔ་མའི་བསོད་ནམས་ཀྱི་ཕུང་པོའི་ཆ་གང་དུའང་བརྗོད་དུ་མི་རུང་ངོ་།
en: If someone were to completely fill ten world systems the size of the Sahā buddhafield with the seven precious substances and offer it every day as a gift to infinite buddhas for an infinite number of eons, that would not account for even a fraction of the former heap of merit.

source: །གང་གིས་ཚད་མེད་པ་དང་ལྡན་པའི་དེ་བཞིན་གཤེགས་པ་ལ་རྗེས་སུ་དྲན་ནས་ཡན་ལག་ལྔས་ཕྱག་བྱས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བས་ཆེས་ཚད་མེད་གྲངས་མེད་པར་འགྱུར་ཏེ།
en: The heap of merit generated by recollecting infinite thus-gone ones and prostrating with the five parts of the body will be infinitely and innumerably greater than that.

source: དེ་དག་བསྐལ་པ་བརྒྱར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: For in ten eons, they will turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུ་འདས་ནས་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པའི་འོད་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བ་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “A hundred million buddhafields away, in the world system called Endowed with Immaculate Light, dwells the thus-gone one, the worthy one, the completely perfect buddha called Perfectly Pure Light.

source: ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་འོད་ཡོངས་སུ་དག་པ་དེའི་མཚན་ཉན་པ་དང་། སེ་གོལ་གཏོགས་པ་སྲིད་དུ་ཡང་བྱམས་པའི་སེམས་སྒོམ་ཞིང་མངོན་པར་དད་པར་བྱེད་པ་དང་། མོས་པར་བྱེད་ཅིང་བདག་གིས་དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་པ་དང་། བྱམས་པའི་སེམས་བསྒོམས་པའི་བདག་གི་དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་ལྡན་པར་གྱུར་ཅིག་ཅེས་ཚིག་འདི་སྐད་དུ་སྨྲ་ན། ཤཱ་རིའི་བུ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི། ཤཱ་རིའི་བུ་གང་གི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ཏེ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ལ་ཉིན་རེ་ཞིང་སྦྱིན་པ་ཕུལ་བ་དེ་བཞིན་དུ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སྦྱིན་པ་ཕུལ་བ་འདི་བས་སྔ་མའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིས་ཅིའི་ཆ་ཙམ་དུ་ཡང་མི་བཟོད་དོ།
en: Śāriputra, the heap of merit generated by completely filling as many world systems as there are grains of sand in the Ganges River with the seven precious substances and offering it every day to as many buddhas as there are grains of sand in the Ganges River, for as many eons as there are grains of sand in the Ganges River, does not compare to a mere fraction of the heap of merit that comes from hearing the name of the thus-gone one Perfectly Pure Light, cultivating loving-kindness for as brief as a finger snap, and with yearning faith and devotion saying, ‘Through my virtuous roots of hearing the name of the thus-gone one and cultivating a loving mind, may all beings become endowed with the wisdom of the buddhas!’ Why is that?

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་ནི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་རོ།
en: It is because through the latter heap of merit one will attain awakening.

source: ཤཱ་རིའི་བུ་གང་དག་ཆོས་ཀྱི་སྦྱིན་པ་ལ་འཛུད་པར་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྦྱིན་པ་ལ་དཔའ་བ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པ་ཡིན་ནོ།
en: Śāriputra, it is because bodhisattvas who are courageous in the gift of Dharma, in that they bestow on others into the gift of Dharma, are close to attaining unexcelled, perfect and complete awakening.

source: །དེ་བས་ན་ཤཱ་རིའི་བུ་ཆོས་ཀྱི་སྦྱིན་པ་མཆོག་ལ་གཟུད་པར་བྱའི་ཟང་ཟིང་གི་སྦྱིན་པ་ལ་གཟུད་པར་མི་བྱའོ།
en: Therefore, Śāriputra, one should bestow on others the supreme gift of Dharma, not material gifts.

source: །གང་དག་སྐྱེས་བུ་དམ་པ་དེ་དག་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ན་དེ་དག་གིས་ཆོས་ཀྱི་སྦྱིན་པ་ཉིད་སྦྱིན་པར་བྱའི། ཟང་ཟིང་གི་སྦྱིན་པ་ནི་མ་ཡིན་ཏེ།
en: Those who offer gifts to sublime persons should give only the gift of Dharma, not material gifts.

source: དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྙེན་པར་འགྱུར་རོ།
en: For in this way they will approach unexcelled, perfect and complete awakening.

source: །བསྐལ་པ་བརྒྱད་ཅུའི་བར་དུ་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In eighty eons, they will turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བརྒྱ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ལྡན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་བླ་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “A hundred thousand buddhafields away, in the world system called Endowed with Dharma, dwells the thus-gone one, the worthy one, the completely perfect buddha called Guru of Dharma.

source: ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་བླ་མ་དེའི་མཚན་ཉན་པ་དང་། དད་པ་ཡང་སྐྱེད་པ་དང་། ཐལ་མོ་སྦྱོར་བར་བྱེད་ཅིང་དེ་དག་ཐམས་ཅད་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་འདི་ལ་ཆོས་གྲུབ་པར་བྱ་བའི་ཕྱིར་སློབ་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Guru of Dharma, give rise to faith, and join palms will train in accomplishing the Dharma under the teaching of this buddha.

source: །ཕན་ཡོན་འདི་དག་འདོད་པས་རི་མོར་བྱས་ཏེ་མོས་པར་བྱའོ།
en: Those who desire these qualities should reverentially long for them.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་ལ་སོ་སོའི་སྐྱེ་བོའི་ཤེས་པས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་ཚད་གཟུང་བར་མི་བྱ་སྟེ། གང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་དེ་ནི་རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཡང་མ་ཡིན་པས་ན།
en: When it comes to the thus-gone ones’ virtues so extolled, the wisdom of a thus-gone one cannot be assessed by the knowledge of an ordinary being, indeed the wisdom of buddhas cannot be assessed by even pratyekabuddhas.

source: དཔེ་འདི་དག་ཐོས་པ་ལས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་བརྙས་པར་མི་བྱ་སྟེ། སེམས་བསྐྱེད་པ་གཅིག་གམ། ངག་གི་ལས་གཅིག་གིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་ལུས་རྣམ་པ་དུ་མར་འགྱུར་བའི་ལས་ཡོངས་སུ་གཟུང་བར་མི་བྱའོ།
en: Thus, based on learning these examples, one should not deride the wisdom of buddhas, just as one should not take up actions by which a single intention or verbal act will lead to the many kinds of births in the terrible hells.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་ཡང་དཀའ།
en: It is because it is rare for the blessed buddhas to appear in the world.

source: མིར་འགྱུར་བ་དང་། དལ་བ་ཕུན་སུམ་ཚོགས་པ་བསྒྲུབ་པ་ཡང་ཤིན་ཏུ་དཀའོ།
en: It is even rarer to be born as a human and obtain excellent leisure.

source: །དེའི་ཕྱིར་དཔེ་ཞིག་བསྟན་པར་བྱ་སྟེ།
en: I will offer an analogy to illustrate this point.

source: ཤཱ་རིའི་བུ་དཔེར་ན་ས་ཆེན་པོ་འདི་རྒྱ་མཚོ་ཆེན་པོ་གཅིག་ཏུ་གྱུར་ཏེ། དེའི་ནང་ན་གཉའ་ཤིང་བུ་ག་གཅིག་པ་ཞིག་ཡོད་ལ། རུས་སྦལ་ཞར་བ་ཞིག་ཀྱང་ཡོད་དེ།
en: Śāriputra, suppose for example that this great earth were one giant ocean, and within it, there were a yoke with one opening and a blind tortoise.

source: རྒྱ་མཚོ་ཆེན་པོ་དེ་ལ་རླུང་ཡར་ལྡང་བ་མར་ལྡང་བ་ཞེས་བྱ་བ་ལྡང་བ་ལ།
en: Suppose that across that giant ocean there blew the wind called the one that blows up and down

source: རུས་སྦལ་ཞར་བ་དེ་ཡང་ལོ་བརྒྱ་བརྒྱ་ཞིང་ལན་ཅིག་ཕྱིར་འབྱུང་བ་རབ་ཏུ་མྱུར་བར་གཉའ་ཤིང་གི་བུ་ག་གཅིག་པ་དེར།
en: Suppose now that the blind tortoise were to surface once every hundred years.

source: རུས་སྦལ་ཞར་བ་ལོ་བརྒྱ་བརྒྱ་ཞིང་ཕྱིར་བྱུང་བའི་མགུལ་པ་ཆུད་པར་སྨྲའི།
en: One might say that the neck of the blind tortoise that surfaces suddenly once every hundred years might enter the opening of the yoke;

source: ལོག་པར་ལྟུང་བ་ལས་ཕྱིར་ཡང་མིར་འགྱུར་བ་ནི་དེ་ལྟ་མ་ཡིན་ཏེ།
en: not so for becoming a human after falling into the lower realms.

source: དེ་ལྟར་ལོག་པར་ལྟུང་བ་རྣམས་ཀྱི་མིར་འགྱུར་བ་རབ་ཏུ་དཀའ་བ་ཡིན་ནོ། །གང་ཡང་མི་ཁོམ་པ་ལ་སོགས་པ་སྤངས་ཏེ།
en: It is much rarer for those who have fallen into the lower realms to later become human. “One should truly congratulate oneself by thinking:

source: ད་ལྟར་མིར་འགྱུར་བ་ཐོབ་ནས་སངས་རྒྱས་བྱུང་བ་ལ་ཡང་མཉེས་པར་བྱས་ཏེ།
en: ‘I have completely avoided inopportune states, and now that I am a human, I have pleased the buddha that has appeared.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོག་གི་ཡེ་ཤེས་དམ་པ་མངའ་བ་ལ་དད་པ་ཐོབ་ནས་བདག་གིས་མིར་འགྱུར་བ་ལེགས་པར་ཐོབ་ཀྱིས།
en: Having acquired faith in a thus-gone one endowed with the sublime wisdom supreme throughout all worlds, I have achieved an ideal human existence.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཆེན་པོ་དང་ལྡན་པ་ལ་བདག་གིས་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཡང་མོས་པར་བྱའོ་སྙམ་ནས་བདག་ཉིད་ཡང་དག་པར་དགའ་བར་བྱའོ། །དེ་དག་གིས་བསྐལ་པ་སུམ་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: I will therefore long, with but a single resolve, for the thus-gone one endowed with the great wisdom of omniscience!’ Those who do so will turn away from saṃsāra in thirty eons.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་ལྔ་བཅུ་རྩ་ལྔ་ན། འཇིག་རྟེན་གྱི་ཁམས་རྒྱུ་བའི་དབང་པོ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifty-five thousand buddhafields away, in the world system called Lord of Movement, dwells the thus-gone one, the worthy one, the completely perfect buddha called Sovereign King of Incense.

source: ཡང་ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོའི་མཚན་ཉན་པ་དང་། དད་པ་སྐྱེད་པར་འགྱུར་བ་དང་། མོས་པར་བྱེད་ཅིང་ཐལ་མོ་སྦྱར་ཏེ་ཚིག་འདི་སྐད་དུ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཟེར་ན་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པར་འགྱུར་ཏེ།
en: Śāriputra, those who hear the name of the thus-gone one Sovereign King of Incense and, with faith and devotion, say with palms joined, ‘Homage to the blessed thus-gone one Sovereign King of Incense!’ will gain an immeasurable heap of merit.

source: དེའི་ཕྱོགས་ཙམ་ཞིག་བསྟན་པར་བྱའོ།
en: I will partially illustrate this.

source: །ཡང་ཤཱ་རིའི་བུ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་གང་བར་བྱས་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཉིན་རེ་ཞིང་སྦྱིན་པ་ཕུལ་ཏེ། དེ་བཞིན་དུ་འབུལ་ཞིང་ལོ་སྟོང་དུ་ཕུལ་བ་བས། གང་གིས་དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་ནས་དད་པ་ཡང་དག་པར་སྐྱེད་པ་དང་། མོས་པར་བྱེད་ཅིང་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་དུ་སྨྲ་བ་འདིའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ལ་སྔ་མའི་བསོད་ནམས་ཀྱི་ཕུང་པོས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། དཔེར་ཡང་མི་བཟོད་དེ།
en: Śāriputra, the heap of merit generated by filling the trigalactic megagalactic world system with the seven precious substances and offering it every day to the blessed buddhas for a thousand years does not approach a hundredth part of the merit of hearing the name of the thus-gone one Sovereign King of Incense and, with faith and devotion, saying with joined palms, ‘Homage to the blessed thus-gone one Sovereign King of Incense!’ Nor will any analogy suffice.

source: བསྐལ་པ་སུམ་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: For those who do so will turn away from saṃsāra in thirty eons.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེན་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་ཆེན་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Ten thousand buddhafields away, in the world system called Endowed with Truth, dwells the thus-gone one, the worthy one, the completely perfect buddha called Great Qualities

source: ཡང་ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཆེན་པོ་དེའི་མཚན་ཉན་པར་འགྱུར་བ་ངེས་པ་ལ་ཞུགས་པ་མ་གཏོགས་པར་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་གྲུབ་པར་བྱེད་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Great Qualities will obtain the qualities of a buddha, unless they have already secured assurance of the final attainment.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་རྒྱན་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eight thousand buddhafields away, in the world system called Endowed with Great Ornament, dwells the thus-gone one, the worthy one, the completely perfect buddha called Light of Incense.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་སྤོས་འོད་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་མིང་གང་གིས་ཉན་པ་དང་། གང་ཉན་པ་དང་། ཐོས་ནས་ཀྱང་མོས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིང་། དེ་དག་ཕྱི་མ་ལ་ངན་སོང་དུ་འགྲོ་བར་མ་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་དེ་ལྟར་བཏབ་པར་གྱུར་ཏོ།
en: Śāriputra, while engaging in the conduct of the bodhisattvas, the thus-gone one Light of Incense made the following aspiration: ‘Once I have perfectly awakened to unexcelled, perfect and complete awakening, may all those who hear my name and become devout upon hearing it make irreversible progress toward unexcelled, perfect and complete awakening and, henceforth, never go to lower realms!’

source: །ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་གང་ཉན་ཅིང་ཐོས་ནས་ཀྱང་། ལྷག་པའི་བསམ་པས་མོས་པར་བྱེད་པ་ནི་སྔོན་གྱི་སྨོན་ལམ་དེས་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: “Hence, Śāriputra, all those who hear that thus-gone one’s name and become wholeheartedly devout upon hearing it will, due to that previous aspiration, make irreversible progress toward unexcelled, perfect and complete awakening.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སུམ་ཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་འཕྲོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirty thousand buddhafields away, in the world system called Immaculate One, dwells the thus-gone one, the worthy one, the completely perfect buddha called Radiant Light.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་དེའི་མཚན་ཐོས་པར་འགྱུར་བ་ཉུང་སྟེ། ཐོས་ནས་མོས་པ་དང་དད་པར་འགྱུར་བ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པར་འགྱུར་རོ།
en: Śāriputra, the few who hear the name of the thus-gone one Radiant Light and become devout and filled with faith upon hearing it will obtain an immeasurable heap of merit.

source: །གང་ཉན་པར་མི་བྱེད་པ་དེ་དག་ནི་བསོད་ནམས་མ་ཡིན་པའི་ཕུང་པོ་ཚད་མེད་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Those who disregard it will incur an immeasurable heap of demerit.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅྭ་ལྔ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་དགའ་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཚད་མེད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifteen thousand buddhafields away, in the world system called Fully Joyous, dwells the thus-gone one, the worthy one, the completely perfect buddha called Immeasurable Light.

source: ཡང་ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་འོད་ཚད་མེད་དེའི་མཚན་ཉན་པར་འགྱུར་བ་དང་། ལྷག་པའི་བསམ་པས་དད་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དེའི་འོད་ཐོབ་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Immeasurable Light and wholeheartedly give rise to faith will obtain the light of that thus-gone one.

source: །གང་དད་པར་མི་བྱེད་པ་དེ་དག་བསྐལ་པ་ཉི་ཤུར་ཚ་བའི་སེམས་ཅན་དམྱལ་བར་བཙོ་བར་འགྱུར་རོ།
en: Those who lack faith will roast in the hot hells for twenty eons.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་ཉི་ཤུ་ན། འཇིག་རྟེན་གྱི་ཁམས་སྙིང་པོ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་བཏང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Twenty thousand buddhafields away, in the world system called Endowed with Essence, dwells the thus-gone one, the worthy one, the completely perfect buddha called Emanating Light.

source: ཡང་ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་འོད་བཏང་བ་དེའི་མཚན་ཉན་པར་འགྱུར་བ་དང་། ཐོས་མ་ཐག་ཏུའང་དད་པ་སྐྱེད་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་བདུད་སྡིག་ཅན་གྱིས་ཐུབ་པར་དཀའ་བར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Emanating Light and give rise to faith immediately upon hearing it will be impervious to the power of evil Māra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཉིས་སྟོང་ལྔ་བརྒྱ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤུག་གི་ཤིང་ཏོག་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Twenty thousand five hundred buddhafields away, in the world system called Replete with Coral Trees, dwells the thus-gone one, the worthy one, the completely perfect buddha called Moon Light.

source: ཤཱ་རིའི་བུ་ཡང་གང་དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་སྒྲོན་མ་དེའི་མཚན་ཉན་པར་འགྱུར་བ་དེ་དག་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་སྦྱིན་གནས་སུ་འགྱུར་རོ།
en: Śāriputra, those who hear the name of the thus-gone one Moon Light will be worthy of veneration in the world with its gods.

source: །དེ་དག་ཡུལ་གང་ན་གནས་པའི་ཡུལ་དེ་ཡང་མཆོད་རྟེན་དུ་འགྱུར་རོ།
en: Wherever they dwell will become a shrine.

source: ཕྱི་མའི་དུས་ན་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉན་པར་འགྱུར་བའི་སྐྱེས་བུ་དམ་པ་དེ་དག་ནི་དཀོན་ནོ།
en: It is because in the future, sublime beings that hear the name of the thus-gone ones will be rare.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མཆོག་ཅེས་བྱ་བ་ན།
en: “Eight thousand buddhafields away, in the world system called Supreme Fragrance, dwells the thus-gone one, the worthy one, the completely perfect buddha called Moonlight.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ། ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་ཟླ་འོད་དེའི་མཚན་ཉན་པར་འགྱུར་བ་དང་། ཐ་ན་རྨི་ལམ་གྱི་ཚེ་ཐོས་ན་ཡང་དད་པ་ཡང་དག་པར་སྐྱེད་པ་དེ་དག་ཐམས་ཅད་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་སྐྱེད་པར་འགྱུར་རོ།
en: Śāriputra, all who hear the name of the thus-gone one Moonlight, even in a dream, and genuinely give rise to faith will generate a great heap of merit.

source: །རི་དང་འདྲ་བར་བདུད་ཐམས་ཅད་ཀྱིས་མི་བསྐྱོད་པར་འགྱུར་རོ།
en: They will become like mountains, impervious to all demons.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཕྲག་བཅུ་གཉིས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཉི་མ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Twelve thousand buddhafields away, in the world system called Endowed with Sun, dwells the thus-gone one, the worthy one, the completely perfect buddha called Light of the Moon.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་ངན་སོང་གི་གཞི་མེད་དོ། །ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དེའི་སྨོན་ལམ་སྔོན་འདི་ལྟར་བཏབ་སྟེ།
en: Śāriputra, in the buddhafield of the thus-gone one Light of the Moon, there is nobody in the lower realms. Śāriputra, previously that thus-gone one made the following aspiration:

source: བྱང་ཆུབ་ཐོབ་པའི་མཚན་དང་མྱ་ངན་ལས་འདས་པ་ཐོས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བཀོད་པ་ཡང་།
en: ‘Upon my attainment of awakening, may all those who hear my name and hear about my transcendence of suffering make irreversible progress toward unexcelled, perfect and complete awakening!

source: ད་ལྟར་གྱི་བདག་གི་ཅི་འདྲ་བ་དེ་འདྲ་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: May the arrangement of their buddhafields be exactly the same as mine is now!’

source: །ཤཱ་རིའི་བུ་གང་ལ་ལ་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྣང་བའི་མཚན་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་དེ་བཞིན་དུ་འགྱུར་རོ།
en: “Śāriputra, such things will come to pass for anyone who hears the name of the thus-gone one Light of the Moon, precisely in accordance with the aspiration he made while previously engaging in the conduct of the bodhisattvas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅྭ་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་གསེར་གྱི་ནོར་བུ་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eighteen thousand buddhafields away, in the world system called Luminous Golden Gem, dwells the thus-gone one, the worthy one, the completely perfect buddha called Firelight.

source: ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་མེ་འོད་ཀྱི་མཚན་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཆོས་ཀྱི་སྒྲོན་མ་ཐོགས་པར་འགྱུར།
en: Śāriputra, all those who hear the name of the thus-gone one Firelight will carry the lamp of the Dharma.

source: འཇིག་རྟེན་ཐམས་ཅད་དང་། སེམས་ཅན་རྣམས་འཁོར་བའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བར་འགྱུར་རོ།
en: They will free all world systems and all beings from the ocean of saṃsāra.

source: །དེ་དག་གི་ཉིན་མཚན་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་ལ་ཞུགས་པས་འདའ་བར་འགྱུར་རོ།
en: They will pass their days and nights immersed in bringing benefit to beings.

source: །དེ་དག་ཆོས་ཀྱི་སྦྱིན་པ་མངོན་པར་གཏོང་ངོ་།
en: They will give the gift of Dharma.

source: །དེ་དག་ནི་བདུད་ཐམས་ཅད་དང་མུ་སྟེགས་ཅན་གཞན་གྱིས་མི་ཐུབ་པར་འགྱུར་རོ།
en: They will be unassailable by all demons and non-Buddhists.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཟུགས་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་རྣམ་པར་རྒྱལ་བའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Ten thousand buddhafields away, in the world system called Luminous Form, dwells the thus-gone one called Victorious Melody.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་གཟུགས་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is this world system called Luminous Form?

source: འཇིག་རྟེན་གྱི་ཁམས་དེར་སེམས་ཅན་གང་སུ་དག་སྐྱེས་པ་དང་། སྐྱེ་བ་དང་། སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་མིའི་ཁ་དོག་ལས་འདས་པར་གྱུར་པ་ཡིན།
en: All the beings that were, are, and will be born in this world system transcend the appearance of humans.

source: སེམས་ཅན་དེ་དག་ཐམས་ཅད་གཟུགས་བཟང་ཞིང་མཛེས་པར་གྱུར་པ་ཡིན་ནོ།
en: Their forms are beautiful and exquisite.

source: །ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་རྒྱལ་བའི་མཚན་ཉན་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་གཟུགས་བཟང་པོར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Victorious Melody will have bodies that are beautified by the qualities of unexcelled, perfect and complete awakening.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་གསུམ་ན་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་རྒྱལ་བ་དང་ལྡན་པ་ན་དེ་བཞིན་གཤེགས་པ་མཆོག་མཛད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirteen thousand buddhafields away, in the world system called Triumphant, dwells the thus-gone one called He Who Acts as Supreme.

source: ཡང་ཤཱ་རིའི་བུ་གང་དེ་བཞིན་གཤེགས་པ་མཆོག་མཛད་དེའི་མཚན་ཉན་པར་འགྱུར་བ་དང་། དད་པ་ཡང་སྐྱེད་པར་འགྱུར་བ་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོག་ཏུ་འགྱུར་རོ།
en: Śāriputra, those who hear the name of the thus-gone one He Who Acts as Supreme and give rise to faith will be supreme in the world with its gods, humans, and asuras.

source: །བསྐལ་པ་ཉི་ཤུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In twenty eons they will turn away from saṃsāra.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་སྟོང་གི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་གཡུལ་ལས་རྣམ་པར་རྒྱལ་ཏེ་རྒལ་བ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མང་པོའི་བླ་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “A trillion buddhafields away, in the world system called Overcoming through Triumph in Battle, dwells the thus-gone one, the worthy one, the completely perfect buddha called Guru of Many.
